package su.opencode.digsigcik.pvva.enums;

public enum PvvResponseType {

    /**
     * <b>Для внешних сервисов</b>: транзакция закончена успешно, отправить ответ в сервис, ожидающий ответа.
     * <br><br>
     * <b>Для ПВВ</b>: отправить сообщение назад, в сервис-источник запроса.
     * <br><br>
     * <b>Пример</b>: отправка СОС из одного контура в другой. Если файл СОС получен и, возможно, успешно провалидирован,
     * то нужно вернуть статус <code>OK</code>, чтобы ПВВ Адаптер (транспортный уровень) отметил передачу как <u>успешную</u>.
     */
    OK,


    // =================================================================================================================


    /**
     * <b>Для внешних сервисов</b>: транзакция закончена, но возникла ошибка. Отправить ответ в сервис, ожидающий ответа.
     * <br><br>
     * <b>Для ПВВ</b>: отправить сообщение назад, в сервис-источник запроса.
     * <br><br>
     * <b>Пример</b>: отправка СОС из одного контура в другой. Если файл СОС получен, но по факту это пустой файл, или
     * файл другого типа - возвращаем статус <code>FAILED</code>, чтобы ПВВ Адаптер (транспортный уровень) отметил
     * передачу как <u>неудачную</u>.
     */
    FAILED,


    // =================================================================================================================


    /**
     * <b>Для внешних сервисов</b> (pvv-fk-adapter, pvv-rrm4d-adapter): первичный запрос получен, начинаем транзакцию,
     * оформляем подписку на другой эндпоинт.
     * <br><br>
     * <b>Для ПВВ</b>: отметить передачу как висящую. Произвести несколько попыток обратиться в полученный эндпоинт
     * на обновление статуса.
     * <br><br>
     * <b>Пример</b>: отправка заявления УЦ ФК из одного контура в другой. Если файл со всеми необходимыми данными был
     * получен, а запрос отправлен в компонент УЦ ФК успешно, то теперь нужно отложено обращаться на другой эндпоинт
     * за результатами (раз в несколько минут проверять статус).
     */
    OK_SUBSCRIPTION_REQUIRED,


    // =================================================================================================================


    /**
     * <b>Для внешних сервисов</b> (pvv-fk-adapter, pvv-rrm4d-adapter): этот статус нужно возвращать в эндпоинте проверки
     * статуса (см. <code>OK_SUBSCRIPTION_REQUIRED</code>) в случае, если полноценного ответа ещё нет (по причине
     * продолжительной операции или из-за неполадок на внешнем сервисе) и нужно продолжать опрашивать этот эндпоинт.
     * <br><br>
     * <b>Для ПВВ</b>: Продолжаем работу с подпиской. Через несколько минут нужно повторить текущий запрос.
     * <br><br>
     * <b>Пример</b>: отправка заявления УЦ ФК из одного контура в другой. Если файл со всеми необходимыми данными был
     * получен, а запрос отправлен в компонент УЦ ФК успешно, то теперь нужно отложено обращаться на <i>другой эндпоинт</i>
     * за результатами (раз в несколько минут проверять статус). При обращении к этому <i>другому эндпоинту</i> он возвращает
     * <code>IDLE_CONTINUE</code>. Значит, продолжаем обращаться пока не истечет предел обращений, или пока эндпоинт не
     * вернёт <code>OK</code> или <code>FAILED</code>.
     */
    IDLE_CONTINUE


    // =================================================================================================================
    // Дальше идут состояния, контролирующие сценарии, когда внешние сервисы не работают
    // продолжительное время. TODO, т.к. не было времени это реализовать
    // =================================================================================================================


    /*
     * При попытке получить сообщение или его обработать произошла ошибка.
     * Пример: отправка СОС из одного контура в другой. Если файл СОС получен, но по факту это пустой файл, или файл другого типа.
     * Реакция со стороны АПВВ: отметить передачу как висящую. Произвести ещё попытку отправить такой же запрос.
     *
    FAILED_TRY_AGAIN_LATER,
     */

    /*
    *     TODO: FAILED_DO_NOT_ACKNOWLEDGE_SENDER
    *
//    FAILED_SILENT,
     */

}
