package su.opencode.digsigcik.pvva.enums;

public enum PvvResponseType {

    /**
     * Сообщение успешно получено (из Адаптера ПВВ) и обработано. То есть всё хорошо, флоу успешно пройдён.
     * Пример: отправка СОС из одного контура в другой. Если файл СОС получен и, возможно, успешно провалидирован, то нужно вернуть этот статус.
     * Реакция со стороны АПВВ: отметить передачу как успешную.
     */
    OK,

    /**
     * При попытке получить сообщение или его обработать произошла ошибка.
     * Пример: отправка СОС из одного контура в другой. Если файл СОС получен, но по факту это пустой файл, или файл другого типа.
     * Реакция со стороны АПВВ: отметить передачу как неудачную.
     */
    FAILED,

    //
    //     FAILED_DO_NOT_ACKNOWLEDGE_SENDER
    //
    FAILED_SILENT,

    /**
     * ================================================================================
     * Сообщение успешно получено (из Адаптера ПВВ) и обработано. Но это только начало!
     * ================================================================================
     * Пример: отправка заявления УЦ ФК из одного контура в другой. Если файл со всеми необходимыми данными был получен,
     * а запрос отправлен в компонент УЦ ФК успешно, то теперь нужно отложенно переобращаться на другой эндпоинт за результатами
     * (раз в несколько минут проверять статус).
     * ================================================================================
     * Реакция со стороны АПВВ: отметить передачу как висящую. Произвести 5 попыток раз в 5 минут на обновление статуса.
     */
    OK_SUBSCRIPTION_REQUIRED,


    /**
     * При попытке получить сообщение или его обработать произошла ошибка.
     * Пример: отправка СОС из одного контура в другой. Если файл СОС получен, но по факту это пустой файл, или файл другого типа.
     * Реакция со стороны АПВВ: отметить передачу как висящую. Произвести ещё попытку отправить такой же запрос.
     */
    FAILED_TRY_AGAIN_LATER,

    /**
     * Продолжаем работу с подпиской
     * TODO: а надо ли отдельно это?
     */
    IDLE_CONTINUE
}
